{"class_name": "Model", "keras_version": "2.2.4", "backend": "tensorflow", "config": {"name": "model_2", "output_layers": [["create_gen_generated_img", 0, 0]], "input_layers": [["create_gen_input", 0, 0]], "layers": [{"class_name": "InputLayer", "name": "create_gen_input", "config": {"sparse": false, "batch_input_shape": [null, 224, 224, 3], "name": "create_gen_input", "dtype": "float32"}, "inbound_nodes": []}, {"class_name": "Conv2D", "name": "create_gen_conv2d_1", "config": {"kernel_size": [9, 9], "dilation_rate": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "padding": "same", "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "activation": "linear", "kernel_regularizer": null, "name": "create_gen_conv2d_1", "bias_regularizer": null, "use_bias": true, "data_format": "channels_last"}, "inbound_nodes": [[["create_gen_input", 0, 0, {}]]]}, {"class_name": "Activation", "name": "create_gen_relu_1", "config": {"trainable": true, "name": "create_gen_relu_1", "activation": "relu"}, "inbound_nodes": [[["create_gen_conv2d_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_9", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "padding": "same", "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "activation": "linear", "kernel_regularizer": null, "name": "conv2d_9", "bias_regularizer": null, "use_bias": true, "data_format": "channels_last"}, "inbound_nodes": [[["create_gen_relu_1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_1", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}, "inbound_nodes": [[["conv2d_9", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_8", "config": {"gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "momentum": 0.8, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_8", "gamma_regularizer": null, "scale": true, "beta_regularizer": null}, "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_10", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "padding": "same", "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "activation": "linear", "kernel_regularizer": null, "name": "conv2d_10", "bias_regularizer": null, "use_bias": true, "data_format": "channels_last"}, "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_9", "config": {"gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "momentum": 0.8, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_9", "gamma_regularizer": null, "scale": true, "beta_regularizer": null}, "inbound_nodes": [[["conv2d_10", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_1", "config": {"trainable": true, "name": "add_1"}, "inbound_nodes": [[["batch_normalization_9", 0, 0, {}], ["create_gen_relu_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_11", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "padding": "same", "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "activation": "linear", "kernel_regularizer": null, "name": "conv2d_11", "bias_regularizer": null, "use_bias": true, "data_format": "channels_last"}, "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_2", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}, "inbound_nodes": [[["conv2d_11", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_10", "config": {"gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "momentum": 0.8, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_10", "gamma_regularizer": null, "scale": true, "beta_regularizer": null}, "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_12", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "padding": "same", "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "activation": "linear", "kernel_regularizer": null, "name": "conv2d_12", "bias_regularizer": null, "use_bias": true, "data_format": "channels_last"}, "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_11", "config": {"gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "momentum": 0.8, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_11", "gamma_regularizer": null, "scale": true, "beta_regularizer": null}, "inbound_nodes": [[["conv2d_12", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_2", "config": {"trainable": true, "name": "add_2"}, "inbound_nodes": [[["batch_normalization_11", 0, 0, {}], ["add_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_13", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "padding": "same", "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "activation": "linear", "kernel_regularizer": null, "name": "conv2d_13", "bias_regularizer": null, "use_bias": true, "data_format": "channels_last"}, "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_3", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}, "inbound_nodes": [[["conv2d_13", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_12", "config": {"gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "momentum": 0.8, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_12", "gamma_regularizer": null, "scale": true, "beta_regularizer": null}, "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_14", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "padding": "same", "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "activation": "linear", "kernel_regularizer": null, "name": "conv2d_14", "bias_regularizer": null, "use_bias": true, "data_format": "channels_last"}, "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_13", "config": {"gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "momentum": 0.8, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_13", "gamma_regularizer": null, "scale": true, "beta_regularizer": null}, "inbound_nodes": [[["conv2d_14", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_3", "config": {"trainable": true, "name": "add_3"}, "inbound_nodes": [[["batch_normalization_13", 0, 0, {}], ["add_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_15", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "padding": "same", "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "activation": "linear", "kernel_regularizer": null, "name": "conv2d_15", "bias_regularizer": null, "use_bias": true, "data_format": "channels_last"}, "inbound_nodes": [[["add_3", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_4", "config": {"trainable": true, "name": "activation_4", "activation": "relu"}, "inbound_nodes": [[["conv2d_15", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_14", "config": {"gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "momentum": 0.8, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_14", "gamma_regularizer": null, "scale": true, "beta_regularizer": null}, "inbound_nodes": [[["activation_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_16", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "padding": "same", "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "activation": "linear", "kernel_regularizer": null, "name": "conv2d_16", "bias_regularizer": null, "use_bias": true, "data_format": "channels_last"}, "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_15", "config": {"gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "momentum": 0.8, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_15", "gamma_regularizer": null, "scale": true, "beta_regularizer": null}, "inbound_nodes": [[["conv2d_16", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_4", "config": {"trainable": true, "name": "add_4"}, "inbound_nodes": [[["batch_normalization_15", 0, 0, {}], ["add_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_17", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "padding": "same", "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "activation": "linear", "kernel_regularizer": null, "name": "conv2d_17", "bias_regularizer": null, "use_bias": true, "data_format": "channels_last"}, "inbound_nodes": [[["add_4", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_5", "config": {"trainable": true, "name": "activation_5", "activation": "relu"}, "inbound_nodes": [[["conv2d_17", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_16", "config": {"gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "momentum": 0.8, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_16", "gamma_regularizer": null, "scale": true, "beta_regularizer": null}, "inbound_nodes": [[["activation_5", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_18", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "padding": "same", "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "activation": "linear", "kernel_regularizer": null, "name": "conv2d_18", "bias_regularizer": null, "use_bias": true, "data_format": "channels_last"}, "inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_17", "config": {"gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "momentum": 0.8, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_17", "gamma_regularizer": null, "scale": true, "beta_regularizer": null}, "inbound_nodes": [[["conv2d_18", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_5", "config": {"trainable": true, "name": "add_5"}, "inbound_nodes": [[["batch_normalization_17", 0, 0, {}], ["add_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_19", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "padding": "same", "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "activation": "linear", "kernel_regularizer": null, "name": "conv2d_19", "bias_regularizer": null, "use_bias": true, "data_format": "channels_last"}, "inbound_nodes": [[["add_5", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_6", "config": {"trainable": true, "name": "activation_6", "activation": "relu"}, "inbound_nodes": [[["conv2d_19", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_18", "config": {"gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "momentum": 0.8, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_18", "gamma_regularizer": null, "scale": true, "beta_regularizer": null}, "inbound_nodes": [[["activation_6", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_20", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "padding": "same", "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "activation": "linear", "kernel_regularizer": null, "name": "conv2d_20", "bias_regularizer": null, "use_bias": true, "data_format": "channels_last"}, "inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_19", "config": {"gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "momentum": 0.8, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_19", "gamma_regularizer": null, "scale": true, "beta_regularizer": null}, "inbound_nodes": [[["conv2d_20", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_6", "config": {"trainable": true, "name": "add_6"}, "inbound_nodes": [[["batch_normalization_19", 0, 0, {}], ["add_5", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_21", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "padding": "same", "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "activation": "linear", "kernel_regularizer": null, "name": "conv2d_21", "bias_regularizer": null, "use_bias": true, "data_format": "channels_last"}, "inbound_nodes": [[["add_6", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_7", "config": {"trainable": true, "name": "activation_7", "activation": "relu"}, "inbound_nodes": [[["conv2d_21", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_20", "config": {"gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "momentum": 0.8, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_20", "gamma_regularizer": null, "scale": true, "beta_regularizer": null}, "inbound_nodes": [[["activation_7", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_22", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "padding": "same", "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "activation": "linear", "kernel_regularizer": null, "name": "conv2d_22", "bias_regularizer": null, "use_bias": true, "data_format": "channels_last"}, "inbound_nodes": [[["batch_normalization_20", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_21", "config": {"gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "momentum": 0.8, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_21", "gamma_regularizer": null, "scale": true, "beta_regularizer": null}, "inbound_nodes": [[["conv2d_22", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_7", "config": {"trainable": true, "name": "add_7"}, "inbound_nodes": [[["batch_normalization_21", 0, 0, {}], ["add_6", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_23", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "padding": "same", "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "activation": "linear", "kernel_regularizer": null, "name": "conv2d_23", "bias_regularizer": null, "use_bias": true, "data_format": "channels_last"}, "inbound_nodes": [[["add_7", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_8", "config": {"trainable": true, "name": "activation_8", "activation": "relu"}, "inbound_nodes": [[["conv2d_23", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_22", "config": {"gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "momentum": 0.8, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_22", "gamma_regularizer": null, "scale": true, "beta_regularizer": null}, "inbound_nodes": [[["activation_8", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_24", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "padding": "same", "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "activation": "linear", "kernel_regularizer": null, "name": "conv2d_24", "bias_regularizer": null, "use_bias": true, "data_format": "channels_last"}, "inbound_nodes": [[["batch_normalization_22", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_23", "config": {"gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "momentum": 0.8, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_23", "gamma_regularizer": null, "scale": true, "beta_regularizer": null}, "inbound_nodes": [[["conv2d_24", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_8", "config": {"trainable": true, "name": "add_8"}, "inbound_nodes": [[["batch_normalization_23", 0, 0, {}], ["add_7", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_25", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "padding": "same", "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "activation": "linear", "kernel_regularizer": null, "name": "conv2d_25", "bias_regularizer": null, "use_bias": true, "data_format": "channels_last"}, "inbound_nodes": [[["add_8", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_9", "config": {"trainable": true, "name": "activation_9", "activation": "relu"}, "inbound_nodes": [[["conv2d_25", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_24", "config": {"gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "momentum": 0.8, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_24", "gamma_regularizer": null, "scale": true, "beta_regularizer": null}, "inbound_nodes": [[["activation_9", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_26", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "padding": "same", "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "activation": "linear", "kernel_regularizer": null, "name": "conv2d_26", "bias_regularizer": null, "use_bias": true, "data_format": "channels_last"}, "inbound_nodes": [[["batch_normalization_24", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_25", "config": {"gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "momentum": 0.8, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_25", "gamma_regularizer": null, "scale": true, "beta_regularizer": null}, "inbound_nodes": [[["conv2d_26", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_9", "config": {"trainable": true, "name": "add_9"}, "inbound_nodes": [[["batch_normalization_25", 0, 0, {}], ["add_8", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_27", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "padding": "same", "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "activation": "linear", "kernel_regularizer": null, "name": "conv2d_27", "bias_regularizer": null, "use_bias": true, "data_format": "channels_last"}, "inbound_nodes": [[["add_9", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_10", "config": {"trainable": true, "name": "activation_10", "activation": "relu"}, "inbound_nodes": [[["conv2d_27", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_26", "config": {"gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "momentum": 0.8, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_26", "gamma_regularizer": null, "scale": true, "beta_regularizer": null}, "inbound_nodes": [[["activation_10", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_28", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "padding": "same", "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "activation": "linear", "kernel_regularizer": null, "name": "conv2d_28", "bias_regularizer": null, "use_bias": true, "data_format": "channels_last"}, "inbound_nodes": [[["batch_normalization_26", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_27", "config": {"gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "momentum": 0.8, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_27", "gamma_regularizer": null, "scale": true, "beta_regularizer": null}, "inbound_nodes": [[["conv2d_28", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_10", "config": {"trainable": true, "name": "add_10"}, "inbound_nodes": [[["batch_normalization_27", 0, 0, {}], ["add_9", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_29", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "padding": "same", "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "activation": "linear", "kernel_regularizer": null, "name": "conv2d_29", "bias_regularizer": null, "use_bias": true, "data_format": "channels_last"}, "inbound_nodes": [[["add_10", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_11", "config": {"trainable": true, "name": "activation_11", "activation": "relu"}, "inbound_nodes": [[["conv2d_29", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_28", "config": {"gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "momentum": 0.8, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_28", "gamma_regularizer": null, "scale": true, "beta_regularizer": null}, "inbound_nodes": [[["activation_11", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_30", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "padding": "same", "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "activation": "linear", "kernel_regularizer": null, "name": "conv2d_30", "bias_regularizer": null, "use_bias": true, "data_format": "channels_last"}, "inbound_nodes": [[["batch_normalization_28", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_29", "config": {"gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "momentum": 0.8, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_29", "gamma_regularizer": null, "scale": true, "beta_regularizer": null}, "inbound_nodes": [[["conv2d_30", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_11", "config": {"trainable": true, "name": "add_11"}, "inbound_nodes": [[["batch_normalization_29", 0, 0, {}], ["add_10", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_31", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "padding": "same", "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "activation": "linear", "kernel_regularizer": null, "name": "conv2d_31", "bias_regularizer": null, "use_bias": true, "data_format": "channels_last"}, "inbound_nodes": [[["add_11", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_12", "config": {"trainable": true, "name": "activation_12", "activation": "relu"}, "inbound_nodes": [[["conv2d_31", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_30", "config": {"gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "momentum": 0.8, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_30", "gamma_regularizer": null, "scale": true, "beta_regularizer": null}, "inbound_nodes": [[["activation_12", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_32", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "padding": "same", "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "activation": "linear", "kernel_regularizer": null, "name": "conv2d_32", "bias_regularizer": null, "use_bias": true, "data_format": "channels_last"}, "inbound_nodes": [[["batch_normalization_30", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_31", "config": {"gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "momentum": 0.8, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_31", "gamma_regularizer": null, "scale": true, "beta_regularizer": null}, "inbound_nodes": [[["conv2d_32", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_12", "config": {"trainable": true, "name": "add_12"}, "inbound_nodes": [[["batch_normalization_31", 0, 0, {}], ["add_11", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_33", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "padding": "same", "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "activation": "linear", "kernel_regularizer": null, "name": "conv2d_33", "bias_regularizer": null, "use_bias": true, "data_format": "channels_last"}, "inbound_nodes": [[["add_12", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_13", "config": {"trainable": true, "name": "activation_13", "activation": "relu"}, "inbound_nodes": [[["conv2d_33", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_32", "config": {"gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "momentum": 0.8, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_32", "gamma_regularizer": null, "scale": true, "beta_regularizer": null}, "inbound_nodes": [[["activation_13", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_34", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "padding": "same", "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "activation": "linear", "kernel_regularizer": null, "name": "conv2d_34", "bias_regularizer": null, "use_bias": true, "data_format": "channels_last"}, "inbound_nodes": [[["batch_normalization_32", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_33", "config": {"gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "momentum": 0.8, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_33", "gamma_regularizer": null, "scale": true, "beta_regularizer": null}, "inbound_nodes": [[["conv2d_34", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_13", "config": {"trainable": true, "name": "add_13"}, "inbound_nodes": [[["batch_normalization_33", 0, 0, {}], ["add_12", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_35", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "padding": "same", "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "activation": "linear", "kernel_regularizer": null, "name": "conv2d_35", "bias_regularizer": null, "use_bias": true, "data_format": "channels_last"}, "inbound_nodes": [[["add_13", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_14", "config": {"trainable": true, "name": "activation_14", "activation": "relu"}, "inbound_nodes": [[["conv2d_35", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_34", "config": {"gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "momentum": 0.8, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_34", "gamma_regularizer": null, "scale": true, "beta_regularizer": null}, "inbound_nodes": [[["activation_14", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_36", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "padding": "same", "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "activation": "linear", "kernel_regularizer": null, "name": "conv2d_36", "bias_regularizer": null, "use_bias": true, "data_format": "channels_last"}, "inbound_nodes": [[["batch_normalization_34", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_35", "config": {"gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "momentum": 0.8, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_35", "gamma_regularizer": null, "scale": true, "beta_regularizer": null}, "inbound_nodes": [[["conv2d_36", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_14", "config": {"trainable": true, "name": "add_14"}, "inbound_nodes": [[["batch_normalization_35", 0, 0, {}], ["add_13", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_37", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "padding": "same", "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "activation": "linear", "kernel_regularizer": null, "name": "conv2d_37", "bias_regularizer": null, "use_bias": true, "data_format": "channels_last"}, "inbound_nodes": [[["add_14", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_15", "config": {"trainable": true, "name": "activation_15", "activation": "relu"}, "inbound_nodes": [[["conv2d_37", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_36", "config": {"gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "momentum": 0.8, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_36", "gamma_regularizer": null, "scale": true, "beta_regularizer": null}, "inbound_nodes": [[["activation_15", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_38", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "padding": "same", "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "activation": "linear", "kernel_regularizer": null, "name": "conv2d_38", "bias_regularizer": null, "use_bias": true, "data_format": "channels_last"}, "inbound_nodes": [[["batch_normalization_36", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_37", "config": {"gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "momentum": 0.8, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_37", "gamma_regularizer": null, "scale": true, "beta_regularizer": null}, "inbound_nodes": [[["conv2d_38", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_15", "config": {"trainable": true, "name": "add_15"}, "inbound_nodes": [[["batch_normalization_37", 0, 0, {}], ["add_14", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "create_gen_conv2d_2", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "padding": "same", "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "activation": "linear", "kernel_regularizer": null, "name": "create_gen_conv2d_2", "bias_regularizer": null, "use_bias": true, "data_format": "channels_last"}, "inbound_nodes": [[["add_15", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "create_gen_batch_norm_1", "config": {"gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "momentum": 0.8, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "create_gen_batch_norm_1", "gamma_regularizer": null, "scale": true, "beta_regularizer": null}, "inbound_nodes": [[["create_gen_conv2d_2", 0, 0, {}]]]}, {"class_name": "Add", "name": "create_gen_add", "config": {"trainable": true, "name": "create_gen_add"}, "inbound_nodes": [[["create_gen_batch_norm_1", 0, 0, {}], ["create_gen_relu_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "test1", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "padding": "same", "strides": [2, 2], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "activation": "linear", "kernel_regularizer": null, "name": "test1", "bias_regularizer": null, "use_bias": true, "data_format": "channels_last"}, "inbound_nodes": [[["create_gen_add", 0, 0, {}]]]}, {"class_name": "Activation", "name": "test2", "config": {"trainable": true, "name": "test2", "activation": "relu"}, "inbound_nodes": [[["test1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "test3", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "padding": "same", "strides": [2, 2], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "activation": "linear", "kernel_regularizer": null, "name": "test3", "bias_regularizer": null, "use_bias": true, "data_format": "channels_last"}, "inbound_nodes": [[["test2", 0, 0, {}]]]}, {"class_name": "Activation", "name": "test4", "config": {"trainable": true, "name": "test4", "activation": "relu"}, "inbound_nodes": [[["test3", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "name": "up_sampling2d_1", "config": {"data_format": "channels_last", "trainable": true, "name": "up_sampling2d_1", "size": [2, 2], "interpolation": "nearest"}, "inbound_nodes": [[["test4", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_39", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 256, "padding": "same", "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "activation": "linear", "kernel_regularizer": null, "name": "conv2d_39", "bias_regularizer": null, "use_bias": true, "data_format": "channels_last"}, "inbound_nodes": [[["up_sampling2d_1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_16", "config": {"trainable": true, "name": "activation_16", "activation": "relu"}, "inbound_nodes": [[["conv2d_39", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "name": "up_sampling2d_2", "config": {"data_format": "channels_last", "trainable": true, "name": "up_sampling2d_2", "size": [2, 2], "interpolation": "nearest"}, "inbound_nodes": [[["activation_16", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_40", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 256, "padding": "same", "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "activation": "linear", "kernel_regularizer": null, "name": "conv2d_40", "bias_regularizer": null, 